a = input("Введите число от 0 до 99 \n")
numb1 = ('', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять',
'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать',
'шестнадцать', 'семнадцать', 'восемнадцать', 'девятнадцать')
numb2 = ('двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят','восемьдесят','девяносто')
try:
    a=int(a)
except ValueError:
    print('Данные введены неверно')
else:
    a=int(a)
    if a<=99 and a>=0:
        if a==0:
            print ('ноль')
        elif a<20:
            print (numb1[a+1])
        else:
            if a<30:
                print (numb2[0] + ' ' + numb1[a-20])
            elif a<40:
                print (numb2[1] + ' ' + numb1[a-30])
            elif a<50:
                print (numb2[2] + ' ' + numb1[a-40])
            elif a<60:
                print (numb2[3] + ' ' + numb1[a-50])
            elif a<70:
                print (numb2[4] + ' ' + numb1[a-60])
            elif a<80:
                print (numb2[5] + ' ' + numb1[a-70])
            elif a<90:
                print (numb2[6] + ' ' + numb1[a-80])
            elif a<100:
                print (numb2[7] + ' ' + numb1[a-90])
    else:
        print ('Данные введены неверно')
